/*
При анализе продаж книг выяснилось, что наибольшей популярностью пользуются книги Михаила Булгакова,
на втором месте книги Сергея Есенина. Исходя из этого решили поднять цену книг Булгакова на 10%,
а цену книг Есенина - на 5%. Написать запрос, куда включить автора, название книги и новую цену,
последний столбец назвать new_price. Значение округлить до двух знаков после запятой.

Структура и наполнение таблицы book:
+---------+-----------------------+------------------+--------+--------+
| book_id | title                 | author           | price  | amount |
+---------+-----------------------+------------------+--------+--------+
| 1       | Мастер и Маргарита    | Булгаков М.А.    | 670.99 | 3      |
| 2       | Белая гвардия         | Булгаков М.А.    | 540.50 | 5      |
| 3       | Идиот                 | Достоевский Ф.М. | 460.00 | 10     |
| 4       | Братья Карамазовы     | Достоевский Ф.М. | 799.01 | 2      |
| 5       | Стихотворения и поэмы | Есенин С.А.      | 650.00 | 15     |
+---------+-----------------------+------------------+--------+--------+

Результат:

+------------------+-----------------------+-----------+
| author           | title                 | new_price |
+------------------+-----------------------+-----------+
| Булгаков М.А.    | Мастер и Маргарита    | 738.09    |
| Булгаков М.А.    | Белая гвардия         | 594.55    |
| Достоевский Ф.М. | Идиот                 | 460.00    |
| Достоевский Ф.М. | Братья Карамазовы     | 799.01    |
| Есенин С.А.      | Стихотворения и поэмы | 682.50    |
+------------------+-----------------------+-----------+
 */

/* через IF */
SELECT author, title,
ROUND(
    IF(author = 'Булгаков М.А.', price + price * 0.10, IF(author = 'Есенин С.А.', price + price * 0.05, price)),
    2) AS new_price
FROM book;

/* через case */
select author, title,
round(case author
    when "Булгаков М.А." then price * 1.1
    when "Есенин С.А." then price * 1.05
    else price end, 2) as new_price
from book;