/*
  Вывести фамилию и инициалы автора, минимальную, максимальную и среднюю цену книг каждого автора .
  Вычисляемые столбцы назвать Минимальная_цена, Максимальная_цена и Средняя_цена соответственно.


  Структура и наполнение таблицы book
+--+---------------------+----------------+------+------+
|id|title                |author          |price |amount|
+--+---------------------+----------------+------+------+
|1 |Мастер и Маргарита   |Булгаков М.А.   |670.99|3     |
|2 |Белая гвардия        |Булгаков М.А.   |540.5 |5     |
|3 |Идиот                |Достоевский Ф.М.|460   |10    |
|4 |Братья Карамазовы    |Достоевский Ф.М.|799.01|2     |
|5 |Стихотворения и поэмы|Есенин С.А.     |650   |15    |
|6 |Дети полуночи        |Рушди Салман    |950   |5     |
|7 |                     |Иванов С.С.     |50    |10    |
|8 |Лирика               |Гумилев Н.С.    |460   |10    |
|9 |Поэмы                |Бехтерев С.С.   |460   |10    |
|10|Капитанская дочка    |Пушкин А.С.     |520.5 |7     |
+--+---------------------+----------------+------+------+

 Результат
+----------------+----------------+-----------------+------------+
|author          |Минимальная_цена|Максимальная_цена|Средняя_цена|
+----------------+----------------+-----------------+------------+
|Бехтерев С.С.   |460             |460              |460         |
|Булгаков М.А.   |540.5           |670.99           |605.745     |
|Гумилев Н.С.    |460             |460              |460         |
|Достоевский Ф.М.|460             |799.01           |629.505     |
|Есенин С.А.     |650             |650              |650         |
|Иванов С.С.     |50              |50               |50          |
|Пушкин А.С.     |520.5           |520.5            |520.5       |
|Рушди Салман    |950             |950              |950         |
+----------------+----------------+-----------------+------------+

 */

SELECT author, MIN(price) as Минимальная_цена,
       MAX(price) as Максимальная_цена,
       AVG(price) as Средняя_цена
FROM book
GROUP BY author;