/*
   Структура и наполнение таблицы book
+--+---------------------+----------------+------+------+
|id|title                |author          |price |amount|
+--+---------------------+----------------+------+------+
|1 |Мастер и Маргарита   |Булгаков М.А.   |670.99|3     |
|2 |Белая гвардия        |Булгаков М.А.   |540.5 |5     |
|3 |Идиот                |Достоевский Ф.М.|460   |10    |
|4 |Братья Карамазовы    |Достоевский Ф.М.|799.01|2     |
|5 |Стихотворения и поэмы|Есенин С.А.     |650   |15    |
|6 |Дети полуночи        |Рушди Салман    |950   |5     |
|7 |                     |Иванов С.С.     |50    |10    |
|8 |Лирика               |Гумилев Н.С.    |460   |10    |
|9 |Поэмы                |Бехтерев С.С.   |460   |10    |
|10|Капитанская дочка    |Пушкин А.С.     |520.5 |7     |
+--+---------------------+----------------+------+------+

 Результат
 +----------------+---------+-----------------+------------------+
|author          |Стоимость|НДС              |Стоимость_без_НДС |
+----------------+---------+-----------------+------------------+
|Бехтерев С.С.   |4600     |701.6899999999999|3898.31           |
|Булгаков М.А.   |4715.47  |719.3100000000001|3996.16           |
|Гумилев Н.С.    |4600     |701.6899999999999|3898.31           |
|Достоевский Ф.М.|6198.02  |945.46           |5252.5599999999995|
|Есенин С.А.     |9750     |1487.29          |8262.710000000001 |
|Иванов С.С.     |500      |76.27000000000001|423.73            |
|Пушкин А.С.     |3643.5   |555.79           |3087.71           |
|Рушди Салман    |4750     |724.58           |4025.4199999999996|
+----------------+---------+-----------------+------------------+

Для каждого автора вычислить суммарную стоимость книг S (имя столбца Стоимость),
   а также вычислить налог на добавленную стоимость  для полученных сумм (имя столбца НДС ) ,
   который включен в стоимость и составляет 18% (k=18),  а также стоимость книг  (Стоимость_без_НДС) без него.
   Значения округлить до двух знаков после запятой.
 */



SELECT author,
       SUM(price * amount) as Стоимость,
       ROUND(SUM(price * amount) * 0.18 / 1.18, 2) as НДС,
       ROUND(SUM(price * amount) - SUM(price * amount) * 0.18 / 1.18, 2) as Стоимость_без_НДС
FROM book
GROUP BY author;