/*
Вывести название, автора и цену тех книг, которые написал Булгаков, ценой больше 600 грн

Результат:

+-----------------------+---------------+--------+
| title                 | author        | price  |
+-----------------------+---------------+--------+
| Мастер и Маргарита    | Булгаков М.А. | 670.99 |
| Стихотворения и поэмы | Есенин С.А.   | 650.00 |
+-----------------------+---------------+--------+
*/

SELECT title, author, price
FROM book
WHERE (author = 'Булгаков М.А.' or author = 'Есенин С.А.') and price > 600;