/*
Вывести название, автора  и стоимость (цена умножить на количество) тех книг, стоимость которых больше 4000 грн

Результат:

+-----------------------+------------------+---------+
| title                 | author           | total   |
+-----------------------+------------------+---------+
| Идиот                 | Достоевский Ф.М. | 4600.00 |
| Стихотворения и поэмы | Есенин С.А.      | 9750.00 |
+-----------------------+------------------+---------+
 */

SELECT title, author, price * amount AS total
FROM book
WHERE price * amount > 4000;